def start(details, context):
    welcome_message = (
        "سلام:)"
        "\n"
        "اگر بار اول هست که دارید از بات استفاده می‌کنید باید بگم که از طریق "
        "منوی دستورات می‌تونید دستور مورد نیاز خودتون رو اجرا کنید و بقیه‌ی "
        "روندش رو از اونجا پیش ببرید."
        "\n"
        "اما اگر در حال استفاده از ربات بودید، با زدن این دکمه اگر مشکلی در ربات وجود داشت "
        "برطرف شده و می‌تونید مجدد از امکانات ربات استفاده کنید."
    )
    context.bot.send_message(
        chat_id=details.effective_chat.id,
        text=welcome_message
    )
